import streamlit as st 

st.title(':red[Hello, world!]')

st.markdown(
    'Хей, все привет, это приложение 505 группы!')

st.markdown(
    ' Да, да, это :violet[полноценный сайт] (вы можете открыть его со своего интернета)'
)

st.markdown(
    'Автор: ***:blue[Копылов Максим]***, между прочим сделал сам, *без* помощи **нейросетей** '
)

st.divider()

st.subheader('Что же тут будет?')

st.markdown(
    'Я планирую сделать несколько разделов, полезных для нашей группы: :green[интерактивное расписание], где будут пометки о предстоящих сдачах/кр, возможность загружать :violet[свои файлы] (например, лабы), :orange[полезные материалы] по предметам, что-то по :red[алгосам?]'
)

st.markdown(
    'Также я выложу код на гитхаб, чтобы ***:rainbow[все]*** могли редактировать сайт (это будет коллективный проект, на который каждый сможет повлиять!)'
)
